# Append Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IntersectionResultArray..::..Append Method
IntersectionResultArray Class See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Append(
	IntersectionResult item
)
```

Visual Basic
---
```text
Public Overridable Sub Append ( _
	item As IntersectionResult _
)
```

Visual C++
---
```text
public:
virtual void Append(
	IntersectionResult^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..IntersectionResult
# See Also
IntersectionResultArray Class
Autodesk.Revit.DB Namespace